qykr/robotics-video-inference-bridge/edge-embedded-client/sdkconfig.defaults.esp32p4
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_LK_EXAMPLE_CODEC_BOARD_TYPE="ESP32_P4_DEV_V14"
CONFIG_DEFAULT_PLAYBACK_VOL=85

# L2 cache config
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Optimize for performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Use UART for console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Enable ISP pipeline for camera
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y

# WebSocket client config
CONFIG_ESP_WS_CLIENT_ENABLE_DYNAMIC_BUFFER=y
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y

# Flash config
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# FreeRTOS config
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# LwIP config for WebRTC
CONFIG_LWIP_MAX_UDP_PCBS=1024
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64

# Use external RAM for mbedTLS
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Use custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y

# Use ESP32-C6 as Wi-Fi coprocessor
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# SPIRAM config
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Camera config for OV5647
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_MIPI_RAW10_1920X1080_30FPS=y
